<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current Box Drive download and packages.
</string>
    <key>Identifier</key>
    <string>com.github.ModernMechanic.pkg.boxdrive</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>BoxDrive</string>
        <key>LANGUAGE</key>
        <string>English</string>
        <key>MAJOR_VERSION</key>
        <string>11</string>
        <key>OS_VERSION</key>
        <string>10.8.0</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.dataJAR-recipes.download.boxdrive</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>AdobeReaderRepackager</string>
            <key>Arguments</key>
            <dict>
                <key>dmg_path</key>
                <string>%pathname%</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>